Repository: Abdulrahman-Shabaka/Flutter-Authentication-with-Localization
Catalog: auth_with_localization/lib/l10n/app_*.arb
Languages: ar

source: Hey! Is That You?
ar: مرحبا! هل هذا انت؟

source: Email
ar: عنوان البريد الاكتروني

source: Password
ar: الرقم السري

source: Our litle secret
ar: الرقم السري

source: Let's go
ar: هيا بنا

source: First Time Here?
ar: اول مرة هنا؟

source: Sign Up
ar: التحق

# emailCanNotBeEmptyPleaseEnterYourEmailAddress
source: email cann't be empty please enter your email address
ar: يجب إدخال عنوان البريد الاكتروني الخاص بك

# passwordCanNotBeEmptyPleaseEnterYourPassword
source: password cann't be empty please enter your password
ar: يجب إدخال الرقم السري الخاص بك

source: Login
ar: تسجيل الدخول

source: Create Account
ar: إنشاء حساب

# welcomeToBo3lozCompany
source: Welcome to Bo3lz Company
ar: مرحبا في شركة بؤلوظ

source: Let me get to know you
ar: اسمح لي بالتعرف عليك

source: Name
ar: الاسم

source: What should i call you?
ar: بماذا يجب علي ان اناديك؟

# nameConNotBeEmptyPleaseEnterYourName
source: name can't be empty please enter your name
ar: يجب إدخال الاسم اتلخاص بك

# alreadyHaveAccount
source: Already have an account?
ar: لديك حساب سابقا؟

source: Tests
ar: التحاليل

source: Tests Packages
ar: باقات التحاليل

source: Home
ar: الصقحة الرئيسيه

source: Search
ar: بحث
